Revit 2027 API
StructuralConnectionHandlerType.FindGenericConnectionType Method
 Finds StructuralConnectionHandlerType which is Generic Connection type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId FindGenericConnectionType(
	Document doc
)
Public Shared Function FindGenericConnectionType (
	doc As Document
) As ElementId
public:
static ElementId^ FindGenericConnectionType(
	Document^ doc
)
static member FindGenericConnectionType :
        doc : Document -> ElementId
Parameters
doc Document
Return Value
ElementId
 Returns id of StructuralConnectionHandlerType which is Generic Connection type of invalidElementId if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace